-- 주말 과제입니다.
-- 각 번호 아래에 sql을 작성해서 테스트 하세요.
USE board_db;

-- 1. post 테이블에 조회수(view_count) 컬럼을 추가하세요.(4바이트 정수형, NOT NULL, 기본값 0)
ALTER TABLE post ADD view_count int NOT NULL DEFAULT 0;

-- 2. post 테이블에 샘플 게시글 20개를 추가하세요.
-- 조회수와 작성일은 기본값(CURRENT_TIMESTAMP) 대신 각각 다른 값으로 직접 입력하세요.
INSERT INTO post (member_id, title, content, created_at, view_count)
VALUES 
(1, 'sample1-1번', 'sample1-1번 안녕', '2026-06-11 13:35:35', 222),
(1, 'sample1-2번', 'sample1-2번', '2026-06-11 13:19:02', 205),
(1, 'sample1-3번', 'sample1-3번', '2026-06-11 05:12:17', 126),
(1, 'sample1-4번', 'sample1-4번', '2026-06-11 05:06:43', 171),
(2, 'sample2-1번', 'sample2-1번 안녕하세요', '2026-06-07 21:44:14', 103),
(2, 'sample2-2번', 'sample2-2번', '2026-06-07 13:45:11', 117),
(2, 'sample2-3번', 'sample2-3번', '2026-06-06 18:55:27', 104),
(2, 'sample2-4번', 'sample2-4번', '2026-06-06 16:35:34', 87),
(3, 'sample3-1번', 'sample3-1번 안녕안녕', '2026-06-06 16:29:58', 115),
(3, 'sample3-2번', 'sample3-2번', '2026-06-06 14:50:43', 112),
(3, 'sample3-3번', 'sample3-3번', '2026-06-06 13:25:46', 102),
(3, 'sample3-4번', 'sample3-4번', '2026-06-04 21:59:48', 702),
(4, 'sample4-1번', 'sample4-1번 안녕하세요', '2026-06-04 20:36:58', 90),
(4, 'sample4-2번', 'sample4-2번', '2026-06-04 19:34:49', 141),
(4, 'sample4-3번', 'sample4-3번', '2026-06-03 21:20:45', 161),
(4, 'sample4-4번', 'sample4-4번', '2026-06-03 20:22:50', 1164),
(5, 'sample5-1번', 'sample5-1번 안녕하십니까', '2026-06-03 19:05:19', 356),
(5, 'sample5-2번', 'sample5-2번', '2026-06-03 17:37:02', 285),
(5, 'sample5-3번', 'sample5-3번', '2026-06-03 17:09:18', 117),
(5, 'sample5-4번', 'sample5-4번', '2026-06-03 16:57:04', 252);


-- 3. reply 테이블에 샘플 댓글 30개를 추가하세요.(작성일은 기본값 대신 각각 다른 값으로 직접 입력하세요.)
-- 작성일은 기본값(CURRENT_TIMESTAMP) 대신 각각 다른 값으로 직접 입력하세요.
INSERT INTO reply (post_id, member_id, content, created_at)
VALUES
(1, 2, 'reply 1-2', '2026-06-11 13:43:22'),
(1, 3, 'reply 1-3-1', '2026-06-11 14:01:20'),
(1, 4, 'reply 1-4-1', '2026-06-11 14:02:37'),
(1, 3, 'reply 1-3-2', '2026-06-11 14:03:53'),
(1, 4, 'reply 1-4-2', '2026-06-11 14:16:58'),
(2, 2, 'reply 2-2', '2026-06-11 13:25:06'),
(2, 3, 'reply 2-3', '2026-06-11 14:57:34'),
(3, 2, 'reply 3-2', '2026-06-11 05:25:06'),
(3, 3, 'reply 3-3', '2026-06-11 07:09:22'),
(3, 4, 'reply 3-4', '2026-06-11 08:20:09'),
(4, 2, 'reply 4-2', '2026-06-11 05:08:47'),
(4, 3, 'reply 4-3', '2026-06-11 05:09:29'),
(4, 1, 'reply 4-1', '2026-06-11 05:11:36'),
(4, 4, 'reply 4-4', '2026-06-11 05:25:01'),
(4, 5, 'reply 4-5', '2026-06-11 07:26:57'),
(5, 2, 'reply 5-2', '2026-06-07 23:43:50'),
(6, 1, 'reply 6-1', '2026-06-07 13:48:53'),
(6, 3, 'reply 6-3', '2026-06-07 13:49:58'),
(6, 4, 'reply 6-4', '2026-06-07 14:14:29'),
(6, 5, 'reply 6-5', '2026-06-07 17:04:01'),
(7, 1, 'reply 7-1', '2026-06-06 18:56:54'),
(7, 3, 'reply 7-3', '2026-06-06 19:29:12'),
(8, 1, 'reply 8-1', '2026-06-06 16:41:39'),
(8, 3, 'reply 8-3', '2026-06-06 16:52:28'),
(9, 1, 'reply 1-2', '2026-06-06 16:30:35'),
(9, 3, 'reply 1-2', '2026-06-06 16:31:17'),
(9, 4, 'reply 1-2', '2026-06-06 16:48:43'),
(9, 5, 'reply 1-2', '2026-06-06 16:51:23'),
(10, 1, 'reply 1-2', '2026-06-06 14:56:29'),
(10, 3, 'reply 1-2', '2026-06-06 16:48:12');

-- 4. post 테이블에서 조회수(view_count)가 10회 이상인 게시글의 제목, 조회수를 조회하세요.
SELECT title, view_count
FROM post
WHERE view_count > 10;


-- 5. post 테이블에서 2번 회원(member_id = 2)이 작성한 모든 게시글의 작성자, 제목, 작성일을 최신순(작성일 내림차순)으로 조회하세요.
SELECT member_id, title, CREATED_AT at
FROM post
WHERE memeber_id = 2;

-- 6. post 테이블에서 본문(content)에 '안녕'이 들어간 게시글 목록의 모든 컬럼을 최신순(작성일 내림차순)으로 조회하세요.
SELECT *
FROM post
WHERE content LIKE ('%안녕%');

-- 7. reply 테이블에서 3번 게시글(post_id = 3)에 달린 모든 댓글의 게시글 id, 본문, 작성일을 오래된 순(작성일 오름차순)으로 조회하세요.
SELECT id, content, created_at
FROM reply
WHERE post_id = 3
ORDER BY created_at ASC;

-- 8. 1페이지당 5개씩 게시글 목록을 보여줄 때 조회수(view_count)가 높은 순서대로 정렬하고 3페이지 게시글 목록의 id, 제목, 조회수를 조회하세요.
SELECT id, title, view_count
FROM post
ORDER BY view_count DESC
LIMIT 10, 5;

-- 과제가 완료되면 본인의 github 레포지토리에 push 하세요.